// Квадратно уравнение. Напишете скрипт, който прочита
// коефициентите на квадратното уравнение ax
// 2
// + bx + c = 0 и го решава
// - отпечатва корените му. Заб. Квадратното уравнение може да има 0, 1
// или 2 корена.

function solve(a,b,c) 
{
    var x1 = (-b + Math.sqrt((b**2) - 4 * a * c)) / (2 * a);
    var x2 = (-b - Math.sqrt((b**2) - 4 * a * c)) / (2 * a);
    console.log("x1 = " + x1);
    console.log("x2 = " + x2);
}

solve(2, 5, -3)
solve(-1, 3, 0)
solve(-2, 4, 3)
solve(5, 2, 8)
